import 'package:glowette/models/product_model.dart';

List<Product> products = [
  Product(
      imagePath: "assets/images/centella_ampoule_foam_125ml.jpg",
      name: "",
      price: 0.0,
      description:
          """غسول فومي (رغوي) خفيف على البشرة، غني بمستخلص السانتيلا الآسيوية (Centella Asiatica) المعروفة بقدرتها على تهدئة الاحمرار وتقوية حاجز البشرة.
ينضف بعمق من غير ما يسبب جفاف أو شد، وبيحافظ على توازن الترطيب الطبيعي للبشرة.

⭐️ أهم الفوائد:
 • ينضف المسام من الشوائب والزيوت الزايدة من غير ما يجهد البشرة
 • يقلل التهيج ويهدي الاحمرار
 • رغوة خفيفة ولطيفة، مثالية للبشرة الحساسة
 • يهيّئ البشرة لباقي خطوات العناية ويخليها تستفيد أكتر من السيروم أو الكريم

👌 المناسب لمين؟
✔️ مناسب لكل أنواع البشرة
✔️ ممتاز للبشرة الحساسة، المختلطة، أو اللي بتعاني من التهيج أو الالتهاب المتكرر"""),
  Product(
      imagePath: "assets/images/centella_ampoule_serum-55ml.jpg",
      name: "",
      price: 0.0,
      description: """تركيز عالي من التهدئة والترميم لبشرة صحية ومتوازنة

سانتيلا أمبول هو سيرم بتركيبة مركّزة من مستخلص نبتة السانتيلا الآسيوية (Centella Asiatica) بنسبة عالية (غالبًا 90% أو أكتر)، بيشتغل على تهدئة البشرة بسرعة، ترميم الحاجز الواقي، وتحسين مرونة الجلد.

مثالي للبشرة الحساسة، المتهيجة، أو اللي بتعاني من آثار الحبوب والاحمرار.

⭐ أهم الفوايد:
 • يهدّي الاحمرار والالتهابات فورًا بفضل تركيز السانتيلا العالي
 • يرطّب البشرة من غير ما يسيب إحساس دهني
 • يسرّع شفاء آثار الحبوب والجروح البسيطة
 • يقوّي حاجز البشرة ويخليها أقل عرضة للجفاف أو التهيج
 • يحسّن ملمس البشرة ويقلل الإحساس بالحكة أو الشد

👌 المناسب لمين؟
✔ مناسب لكل أنواع البشرة
✔ مثالي للبشرة الحساسة، المتهيجة، المعرضة للحبوب أو بعد التقشير
✔ ممتاز بعد التعرض للشمس أو الرياح أو التهيج العام"""),
  Product(
      imagePath: "assets/images/axis-y-gel-cleaner.jpg",
      name: "",
      price: 0.0,
      description:
          """غسول Axis-Y يعتبر من أفضل الغسولات الكورية المخصصة للبشرة المعرضة للحبوب والمسام الواسعة.
المنتج يحتوي على مستخلص عشبة mugwort (الشيح الكوري) المعروفة بقدرتها على تنقية البشرة، تهدئة الالتهاب، وتنظيف المسام من العمق.


⭐ أهم الفوائد:
 • ينظّف البشرة بعمق من الأوساخ والدهون الزائدة
 • يقلل من مظهر المسام الواسعة
 • يهدئ الحبوب والالتهابات بسبب خصائص الـ Mugwort المضادة للبكتيريا
 • يحتوي على مكونات مقشرة لطيفة تساعد على إزالة الجلد الميت وتحسين ملمس البشرة
 • يترك البشرة نضرة، نظيفة، ومنتعشة بدون إحساس بالشد أو الجفاف


🍃 أهم المكونات:
 • Mugwort Extract: يهدئ البشرة وينظف المسام
 • Salicylic Acid (BHA): مقشر كيميائي لطيف بيحارب الحبوب
 • المكونات النباتية الكورية: تركيبة مدروسة للمساعدة في توازن البشرة الدهنية والمختلطة


👌 المناسب لمين؟
✔ البشرة الدهنية
✔ البشرة المختلطة
✔ البشرة اللي بتعاني من الحبوب، الرؤوس السوداء، أو المسام الواسعة
✔ غير مناسب للبشرة الجافة جدًا أو الحساسة قوي إلا لو كان بتستخدم باعتدال"""),
  Product(
      imagePath: "assets/images/centella-soothing-cream-75ml.jpg",
      name: "",
      price: 0.0,
      description: """كريم مرطب ومهدئ – لبشرة ناعمة، مرتاحة، ومتوازنة

سانتيلا سموزي كريم هو كريم بتركيبة غنية ولطيفة في نفس الوقت، بيعتمد على مستخلص السانتيلا الآسيوية (Centella Asiatica) المعروف بقدرته الفائقة على تهدئة البشرة، ترميم الحاجز الواقي، وترطيب الجلد بعمق.

تصميمه خفيف على البشرة وبيمتص بسرعة من غير ما يترك ملمس دهني، وعلشان كده هو مناسب جدًا كخطوة أخيرة في روتين العناية بالبشرة.


⭐ الفوائد الرئيسية:
 • يرطّب البشرة بعمق ويحافظ على نعومتها
 • يقلل الاحمرار، الالتهابات، والتهيج خاصة بعد الغسول أو التعرض للشمس
 • يساعد على شفاء الحبوب وآثارها ويهدّي البشرة المعرضة للمشاكل
 • يعزز مرونة البشرة ويحسّن ملمسها بشكل ملحوظ
 • يدعم تجديد الخلايا ويحافظ على مظهر صحي ومشرق


👌 المناسب لمين؟
✔ كل أنواع البشرة
✔ مثالي للبشرة الحساسة، الجافة، أو المعرضة للحبوب والاحمرار
✔ مناسب جداً بعد التقشير أو استخدام منتجات فعالة (زي الريتينول أو الأحماض)"""),
  Product(
      imagePath: "assets/images/centella-light-cleansing-oil-200ml.jpg",
      name: "",
      price: 0.0,
      description:
          """غسول زيتي لطيف ومغذي بتركيبة غنية بمستخلص نبتة السانتِيلا الآسيوية (Centella Asiatica) المعروفة بخصائصها الفائقة في تهدئة البشرة وتجديد خلاياها.
مثالي لإزالة المكياج، الشوائب، وواقي الشمس بدون ما يسبب جفاف أو تهيج للبشرة.

⭐ الفوايد الرئيسية:
 • يذيب المكياج الثقيل والواقي الشمسي بكل سلاسة
 • يحتوي على زيوت طبيعية تنظف بلُطف وتحافظ على ترطيب البشرة
 • مستخلص السانتِيلا يساعد على تقليل الالتهابات وتهدئة التهيج
 • ما بيسدش المسام ومناسب للبشرة الحساسة والمتهيجة
 • يسيب البشرة ناعمة، مرتاحة ومنتعشة بعد الغسيل

🌿 المناسب لمين؟
✔ مناسب لكل أنواع البشرة، خصوصًا البشرة الحساسة، الجافة، أو اللي بتتعرض للتهيج بسرعة.
✔ آمن للاستخدام اليومي كخطوة أولى في الروتين"""),
  Product(
      imagePath: "assets/images/bha-treatment-toner.jpg",
      name: "",
      price: 0.0,
      description:
          """منتج كوري ينتمي لمجموعة تقشير كيميائي BHA بتركيز 4% من بيتين ساليسيليت (مشتق لطيف من الساليسيليك أسيد)، إلى جانب ماء لحاء الصفصاف، نياسيناميد، وبانثينول  .
 • يُستخدم لتقشير المسام بعمق، إزالة الرؤوس السوداء والبيضاء، تحسين ملمس البشرة وتوحيد لونها."""),
  Product(
      imagePath: "assets/images/axis-y-panthenol-50l.jpg",
      name: "",
      price: 0.0,
      description: """"ويُعرف باسم: كريم بانثينول من Axis-Y)
🌱 تقوية الحاجز – ترطيب عميق – تهدئة فورية

كريم Axis-Y ببانثينول هو كريم خفيف لكن فعّال، بيشتغل على ترميم حاجز البشرة المتضرر، ترطيب الجلد بعمق، وتهدئة أي تهيج أو احمرار بسرعة.
بيحتوي على تركيبة مدروسة من البانثينول (فيتامين B5)، ومستخلص الخرشوف (Artichoke)، ومكونات نباتية كورية مضادة للالتهاب.


⭐ الفوائد الأساسية:
 • يرطّب البشرة من العمق ويحميها من الجفاف
 • يعزز مرونة الجلد ويقوّي الحاجز الواقي
 • يهدئ التهيج، الاحمرار، والحكة
 • يحسن ملمس البشرة ويقلل المظهر المتعب أو المجهد
 • آمن جداً بعد استخدام الريتينول، الأحماض، أو التعرض للشمس


🌿 المكونات الرئيسية:
 • Panthenol (Vitamin B5): يرطّب، يرمم، ويهدئ البشرة
 • Artichoke Extract: يقوي حاجز البشرة ويقلل المسام
 • Centella Asiatica + 6 مكونات نباتية: لتهدئة فورية ومضادة للالتهابات


👌 المناسب لمين؟
✔ البشرة الحساسة
✔ البشرة الجافة أو المتهيجة
✔ مناسب بعد التقشير، الشمس، أو منتجات قوية
✔ آمن جداً لكل أنواع البشرة – حتى في فترات ضعف البشر"""),
  Product(
      imagePath: "assets/images/carmex-balm.jpg",
      name: "",
      price: 0.0,
      description:
          """كارمكس واحد من أشهر وأقوى أنواع ليب بالم في العالم، بتركيبته العلاجية اللي بتعالج تشققات الشفايف وترجعها ناعمة ومرطّبة في وقت قصير.
مثالي جداً للشفايف الشديدة الجفاف، المشققة، أو المعرضة للتقشر.

⭐ أهم الفوائد:
 • يرطب الشفايف بعمق ويوفر راحة فورية
 • يعالج التشققات الحادة بسرعة
 • يحتوي على منتول وكامفور لتهدئة وراحة فورية
 • فيه SPF 15 للحماية من الشمس (في بعض الأنواع)
 • يحمي من العوامل الجوية القاسية (الهواء البارد – الشمس – الجفاف)"""),
  Product(
      imagePath: "assets/images/anua-niacinamide-10%-30ml.jpg",
      name: "",
      price: 0.0,
      description:
          """سيروم كوري مركّز على تفتيح البشرة وتقليل البقع الداكنة، يحتوي على:
 • Niacinamide 10% (فيتامين B3): يقلل البقع، يوحّد لون البشرة، ينظّم الإفرازات الدهنية.
 • Tranexamic Acid 4%: يُعَدّ مكوّنًا فعّالًا ضد البقع الصبغية ومناسب للبشرة الحسّاسة.
 • بالإضافة إلى Ceramides، Hyaluronic Acid، Vitamin B12 لترطيب وحماية البشرة"""),
  Product(
      imagePath: "assets/images/axis-y-collagen-eye-serum-10ml.jpg",
      name: "",
      price: 0.0,
      description: """يهدف لمعالجة:
 • الخطوط الدقيقة والتجاعيد
 • الانتفاخ وتورم الجفون (eye bags)
 • الهالات السوداء
 • الجفاف حول العين
 • مناسبة للبشرة الحسّاسة
 سيروم يُركّز على تحسين مرونة وروتين العين ويُعدّ خيارًا للنباتيين، يأتي بتقنية “الكولاجين النباتي” + 5 أنواع ببتيدات + حمض الهيالورونيك ثلاثي الحجم + مستخلصات فواكه غنيّة بفيتامين C مثل تفاح، برقوق، وعنب""")
];
